## Importing Libraries

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime

sns.set()

## About Data

Data Source : https://www.kaggle.com/datasets/rodsaldanha/arketing-campaign

- AcceptedCmp1 - 1 if customer accepted the offer in the 1st campaign, 0 otherwise
- AcceptedCmp2 - 1 if customer accepted the offer in the 2nd campaign, 0 otherwise
- AcceptedCmp3 - 1 if customer accepted the offer in the 3rd campaign, 0 otherwise
- AcceptedCmp4 - 1 if customer accepted the offer in the 4th campaign, 0 otherwise
- AcceptedCmp5 - 1 if customer accepted the offer in the 5th campaign, 0 otherwise
- Response (target) - 1 if customer accepted the offer in the last campaign, 0 otherwise
- Complain - 1 if customer complained in the last 2 years
- DtCustomer - date of customer’s enrolment with the company
- Education - customer’s level of education
- Marital - customer’s marital status
- Kidhome - number of small children in customer’s household
- Teenhome - number of teenagers in customer’s household
- Income - customer’s yearly household income
- MntFishProducts - amount spent on fish products in the last 2 years
- MntMeatProducts - amount spent on meat products in the last 2 years
- MntFruits - amount spent on fruits products in the last 2 years
- MntSweetProducts - amount spent on sweet products in the last 2 years
- MntWines - amount spent on wine products in the last 2 years
- MntGoldProds - amount spent on gold products in the last 2 years
- NumDealsPurchases - number of purchases made with discount
- NumCatalogPurchases - number of purchases made using catalogue
- NumStorePurchases - number of purchases made directly in stores
- NumWebPurchases - number of purchases made through company’s web site
- NumWebVisitsMonth - number of visits to company’s web site in the last month
- Recency - number of days since the last purchase

## Load Dataset

In [2]:
data = pd.read_csv('data/marketing_campaign.csv', delimiter=';')
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,2012-09-04,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,2014-03-08,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,2013-08-21,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,2014-02-10,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,2014-01-19,94,173,...,5,0,0,0,0,0,0,3,11,0

## Exploratory Data Analysis

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [4]:
print("Unique values in Education column:", data['Education'].unique())
print("Unique values in Marital_Status column:", data['Marital_Status'].unique())

Unique values in Education column: ['Graduation' 'PhD' 'Master' 'Basic' '2n Cycle']
Unique values in Marital_Status column: ['Single' 'Together' 'Married' 'Divorced' 'Widow' 'Alone' 'Absurd' 'YOLO']

In [5]:
def education_level(education):
    if education in ['Graduation', 'PhD', 'Master']:
        return 'High'
    elif education in ['Basic']:
        return 'Middle'
    else:
        return 'Low'

data['Education_Level'] = data['Education'].apply(education_level)
data = data.drop('Education', axis=1)

In [6]:

def living_status(marital_status):
    if marital_status in ['Alone', 'Absurd', 'YOLO']:
        return 'Living Alone'
    else:
        return 'Living with Others'

data['Living_Status'] = data['Marital_Status'].apply(living_status)
data = data.drop('Marital_Status', axis=1)

In [7]:
data['Age'] = 2023 - data['Year_Birth']
data = data.drop('Year_Birth', axis=1)
data.head()

,ID,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,...,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response,Education_Level,Living_Status,Age
0,5524,58138.0,0,0,2012-09-04,58,635,88,546,172,...,0,0,0,0,3,11,1,High,Living with Others,66
1,2174,46344.0,1,1,2014-03-08,38,11,1,6,2,...,0,0,0,0,3,11,0,High,Living with Others,69
2,4141,71613.0,0,0,2013-08-21,26,426,49,127,111,...,0,0,0,0,3,11,0,High,Living with Others,58
3,6182,26646.0,1,0,2014-02-10,26,11,4,20,10,...,0,0,0,0,3,11,0,High,Living with Others,39
4,5324,58293.0,1,0,2014-01-19,94,173,43,118,46,...,0,0,0,0,3,11,0,High,Living with Others,42

In [8]:
data['Income'] = data['Income'].fillna(data['Income'].mean())
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Income               2240 non-null   float64
 2   Kidhome              2240 non-null   int64
 3   Teenhome             2240 non-null   int64
 4   Dt_Customer          2240 non-null   object
 5   Recency              2240 non-null   int64
 6   MntWines             2240 non-null   int64
 7   MntFruits            2240 non-null   int64
 8   MntMeatProducts      2240 non-null   int64
 9   MntFishProducts      2240 non-null   int64
 10  MntSweetProducts     2240 non-null   int64
 11  MntGoldProds         2240 non-null   int64
 12  NumDealsPurchases    2240 non-null   int64
 13  NumWebPurchases      2240 non-null   int64
 14  NumCatalogPurchases  2240 non-null   int64
 15  NumStorePurchases    2240 non-null   int64
 16  NumWebVisitsMonth    2240 non-null   int64
 17  AcceptedCmp3         2240 non-null   int64
 18  AcceptedCmp4         2240 non-null   int64
 19  AcceptedCmp5         2240 non-null   int64
 20  AcceptedCmp1         2240 non-null   int64
 21  AcceptedCmp2         2240 non-null   int64
 22  Complain             2240 non-null   int64
 23  Z_CostContact        2240 non-null   int64
 24  Z_Revenue            2240 non-null   int64
 25  Response             2240 non-null   int64
 26  Education_Level      2240 non-null   object
 27  Living_Status        2240 non-null   object
 28  Age                  2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [9]:
# print(pd.to_datetime(data['Dt_Customer']).dt.year)

data['Dt_Customer']=pd.to_datetime(data['Dt_Customer'])
# data['Cust_Age'] =  date.today() - pd.to_datetime(data['Dt_Customer'])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Income               2240 non-null   float64
 2   Kidhome              2240 non-null   int64
 3   Teenhome             2240 non-null   int64
 4   Dt_Customer          2240 non-null   datetime64[ns]
 5   Recency              2240 non-null   int64
 6   MntWines             2240 non-null   int64
 7   MntFruits            2240 non-null   int64
 8   MntMeatProducts      2240 non-null   int64
 9   MntFishProducts      2240 non-null   int64
 10  MntSweetProducts     2240 non-null   int64
 11  MntGoldProds         2240 non-null   int64
 12  NumDealsPurchases    2240 non-null   int64
 13  NumWebPurchases      2240 non-null   int64
 14  NumCatalogPurchases  2240 non-null   int64
 15  NumStorePurchases    2240 non-null   int64
 16  NumWebVisitsMonth    2240 non-null   int64
 17  AcceptedCmp3         2240 non-null   int64
 18  AcceptedCmp4         2240 non-null   int64
 19  AcceptedCmp5         2240 non-null   int64
 20  AcceptedCmp1         2240 non-null   int64
 21  AcceptedCmp2         2240 non-null   int64
 22  Complain             2240 non-null   int64
 23  Z_CostContact        2240 non-null   int64
 24  Z_Revenue            2240 non-null   int64
 25  Response             2240 non-null   int64
 26  Education_Level      2240 non-null   object
 27  Living_Status        2240 non-null   object
 28  Age                  2240 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(25), object(2)
memory usage: 507.6+ KB

In [10]:
data['Dt_Customer'] = data['Dt_Customer'].astype('datetime64[ns]')
data['Cust_Age'] = ((pd.to_datetime('now') - pd.to_datetime(data['Dt_Customer'])) / np.timedelta64(1, 'Y')).astype('int64')
data = data.drop('Dt_Customer', axis=1)
data.head()

,ID,Income,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,...,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response,Education_Level,Living_Status,Age,Cust_Age
0,5524,58138.0,0,0,58,635,88,546,172,88,...,0,0,0,3,11,1,High,Living with Others,66,10
1,2174,46344.0,1,1,38,11,1,6,2,1,...,0,0,0,3,11,0,High,Living with Others,69,8
2,4141,71613.0,0,0,26,426,49,127,111,21,...,0,0,0,3,11,0,High,Living with Others,58,9
3,6182,26646.0,1,0,26,11,4,20,10,3,...,0,0,0,3,11,0,High,Living with Others,39,9
4,5324,58293.0,1,0,94,173,43,118,46,27,...,0,0,0,3,11,0,High,Living with Others,42,9